InformationRegisters/фин_ПорядокАктуализацииСтатейБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>фин_ПорядокАктуализацииСтатейБюджетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АктуализацияДефицита</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ПорядокАктуализацииСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктуализацияПрофицита</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ПорядокАктуализацииСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяДляПереносаДефицита</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяДляПереносаПрофицита</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктуализацияДефицитаТолькоПриНаличииИсполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктуализацияПрофицитаТолькоПриНаличииИсполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПорядокРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормируемыйСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/фин_ПорядокАктуализацииСтатейБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ПорядокАктуализацииСтатейБюджетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеАктуализировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоПривестиКФактическимЗначениям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеренестиНаСледующийПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределитьНаСледующиеПериоды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеренестиНаДругуюСтатью</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/фин_ПорядокАктуализацииСтатейБюджетов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура АктуализацияДефицитаПриИзменении(Элемент)
	Если НЕ Запись.АктуализацияДефицита=ПредопределенноеЗначение("Перечисление.фин_ПорядокАктуализацииСтатейБюджетов.ПеренестиНаДругуюСтатью") Тогда
		Запись.СтатьяДляПереносаДефицита=ПредопределенноеЗначение("Справочник.фин_СтатьиБюджета.ПустаяСсылка");
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура АктуализацияПрофицитаПриИзменении(Элемент)
	Если НЕ Запись.АктуализацияПрофицита=ПредопределенноеЗначение("Перечисление.фин_ПорядокАктуализацииСтатейБюджетов.ПеренестиНаДругуюСтатью") Тогда
		Запись.СтатьяДляПереносаПрофицита=ПредопределенноеЗначение("Справочник.фин_СтатьиБюджета.ПустаяСсылка");
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	Форма.Элементы.СтатьяДляПереносаДефицита.Видимость = Форма.Запись.АктуализацияДефицита=ПредопределенноеЗначение("Перечисление.фин_ПорядокАктуализацииСтатейБюджетов.ПеренестиНаДругуюСтатью");
	Форма.Элементы.СтатьяДляПереносаПрофицита.Видимость = Форма.Запись.АктуализацияПрофицита=ПредопределенноеЗначение("Перечисление.фин_ПорядокАктуализацииСтатейБюджетов.ПеренестиНаДругуюСтатью");
КонецПроцедуры
